<?php

namespace FakerRestaurant\Provider\ar_SA;

use FakerRestaurant\AbstractRestaurant;

class Restaurant extends AbstractRestaurant
{
    protected static $foodNames = [
        'بيتزا بالجبنة', 'همبرغر', 'برجر بالجبنة', 'برجر لحمبقري', 'برغر لحم بالجبنة',
        'ليتل همبرغر', 'ليتل تشيز برجر', 'ليتل بيكون برجر', 'ليتل بيكون تشيز برجر',
        'ساندوتش فيجي', 'سندويتش جبن فيجي', 'جبنة مشوية',
        'نقانق الجبن', 'نقانق لحم بقري', 'نقانق لحم بقري بالجبنة', 'معكرونة'
    ];

    protected static $beverageNames = [
        'بابونج', 'شاي أخضر', 'مليسة', 'إكليل الجبل',
        'اللبن المخفوق', 'شاي', 'شاي حلو', 'قهوة', 'شاي ساخن',
        'عصير البرتقال', 'نبيذ', 'عصير الليمون', 'الكوكا كولا', 'كولا للحمية',
        'ماء', 'سبرايت', 'عصير البرتقال', 'قهوة مثلجة'
    ];

    protected static $dairyNames = [
        'زبدة',
        'بيضة',
        'جبنه',
        'الكريمة الحامضة',
        'موزاريلا',
        'زبادي',
        'كريم',
        'حليب',
        'كاسترد',
    ];

    protected static $vegetableNames = [
        'بصل',
        'ثوم',
        'طماطم',
        'البطاطس',
        'جزر',
        'فلفل حلو',
        'بقدونس',
        'بروكلي',
        'حبوب ذرة',
        'سبانخ',
        'زنجبيل',
        'الفلفل الحار',
        'كرفس',
        'إكليل الجبل',
        'خيار',
        'مخلل',
        'أفوكادو',
        'يقطين',
        'نعناع',
        'باذنجان',
        'بطاطا',
    ];

    protected static $fruitNames = [
        'ليمون',
        'تفاحة',
        'موز',
        'جير',
        'الفراولة',
        'البرتقالي',
        'أناناس',
        'توت بري',
        'زبيب',
        'جوزة الهند',
        'عنب',
        'خوخ',
        'توت العليق',
        'كرز',
        'مانجو',
        'كمثرى',
        'بلاك بيري',
        'كرز',
        'البطيخ',
        'كيوي',
        'بابايا',
        'جوافة',
        'ليتشي',
    ];

    protected static $meatNames = [
        'دجاج',
        'لحم بقري',
        'سجق',
        'لحم تيس',
        'لحم عجول',
        'نقانق',
        'لحم جملي',
        'ديك رومي',
        'جناح دجاجة',
        'صدر دجاج',
        'لحم ضأن',
    ];

    protected static $sauceNames = [
        'صلصة طماطم',
        'معجون الطماطم',
        'صوص مايونيز',
        'صلصة شواء',
        'صلصة الفلفل الحار',
        'صلصة الثوم',
    ];
}
